{
  "id": "c33ecfa8-7295-4672-8fb9-2cec2d5c5399",
  "title": "price tag printer",
  "favoriteLevel": 400,
  "resumeFavoriteLevel": 500,
  "descriptions": {
    "shortDescriptions": [
      {
        "language": "en",
        "content": "Expedites the price tag printing process at my store, allowing for easier and faster printing of better-looking price tags."
      },
      {
        "language": "jp",
        "content": "値札の印刷の過程を促進し、きれいな値札をより簡単かつ速く作れるようにするアプリ"
      }
    ],
    "longDescriptions": [
      {
        "language": "en",
        "content": "Receives copies of the store's database via an upload form, then stores the copy.\n\nReads from the database when scanning a product to automatically fill name, price, and barcode fields on the price tag. Gives audible feedback (success / error beeps) after each scan so the user doesn't have to look at the screen. After scanning all desired products, instantly creates a page or pages to be printed.\n\nWhen uploading the database, automatically checks for updated products, then queues them for printing if the name or price has changed since last printed.\n\nCan accommodate and keep track of size of barcode on a per-product basis in case of different size displays."
      },
      {
        "language": "jp",
        "content": "POSレジからデータベースをアップロードするフォームがあり、それを保存します。\n\n商品をスキャンすれば、コピーしたデータベースでその品名や値段が自動的に入力されます。音が出るので成功したか画面を見ず確認でき、作業が速いです。印刷したいものすべて登録し終わったら、印刷できるページが瞬間的に作られます。\n\nデータベースを更新するさい、品名や値段が変わっていないか自動的にチェックされます。前に印刷したもので、品名や値段が変わっていれば、「これ作り直したほうがいいよ」と自動的に印刷待ちの列に入ります。"
      }
    ],
    "bulletPoints": [
      {
        "language": "en",
        "content": [
          "Expedited the price tag printing process, allowing for easier and faster printing of better-looking price tags",
          "Replaced the most time-consuming and inconvenient task into one of the most quick and easy.",
          "Saved countless man hours and improved the overall look of the displays."
        ]
      },
      {
        "language": "jp",
        "content": [
          "値札印刷の迅速化、たくさんの商品の値札を一気に印刷できるようにした",
          "手間がかかる不便な作業を、手軽で簡単な作業にした",
          "多くの時間と労力を節約し、ディスプレイ全体の外観を向上させた"
        ]
      }
    ]
  },
  "site": "https://github.com/birkheadc/PriceTagPrinter",
  "source": "https://github.com/birkheadc/PriceTagPrinter",
  "technologies": [
    "SQLite",
    "CSS",
    "ASP.NET",
    "C#",
    "HTML5",
    "Blazor"
  ]
}
